[
  {
    "id": "35aab518-ddc2-0532-3a17-773bed320e17",
    "text": "Salum Bakari Salum vs Republic (Misc. Criminal Application 35 of 2021) [2021] TZHC 6001 (19 August 2021); Page 1 IN THE HIGH COURT OF THE UNITED REPUBLIC OF TANZANIA IN THE DISTRICT REGISTRY OF DODOMA AT DODOMA MISC. CRIMINAL APPLICATION NO. 35 OF 2021 (From Economic Case No. 7/2019 From District Court of Kondoa ) SALUM BAKAR SALUM ....... ..... APPLICANT VERSUS THE REPUBLIC RESPONDENT RULING Date of last order: 16.08. 2021 Date of Ruling: 19.08. 2021 DR. A. J. MAMBI, J. The Applicant SALUM BAKAR SALUM through his chamber summons filed this application to vary some conditions of bail. Earlier on the 13/4/21 the applicant was granted bail by this court in application No.2 of 2021. One of the condition was that the applicant was required to deposit the amount of tshs 7,613,060/- which is the half amount of the total value of the trophy that is tshs. 15,226, 120/= without other option. He thus submitted that since he is not able deposit cash money, he prayed to present the Page 2 document indicating the ownership of an immovable property that has similar value. The Republic, through the learned State Attorney Ms Magili submitted that the Republic has no objection with this application. I have considerably gone through the application supported by affidavit and submissions from both parties. It is clear from the records that the applicant was granted bail pending determination of his main case at the Trial Court in Kondoa. I have also perused the ruling of this court and found that the applicant had only one option to pay or deposit the half amount of the value of the trophy. This means that he had no option to present the title deed or any other document indicating similar value of the half amount. It is now the position of the law that where the applicant is not able to pay the money in cash to fulfil the bail conditions, he may present any document from the village government, or any other government authority. Having consideration the application and submission by both parties, I am of considered view that the applicant deserves to present the documents such as title deed, customary Right of occupancy, or any other document from the village government, or any other government authority in lieu of the prescribed amount of money. It is prudent the accused be immediately granted bail by this court to avoid unnecessary delay of justice. 2 Page 3 From the above reason, the court grants bail to the applicant subject to the following conditions:- 1) The applicant to have two reliable sureties residing within Kondoa or Dodoma Region. All sureties to present introduction letters from their respective Kitongoji or Mtaa leaders or any government authority in their area of residence to the High Court Registrar. 2) The applicant or his sureties shall deposit tshs. 7, 613, 060/= to the High Court of Dodoma documents indicating ownership of immovable properties equivalent to this amount. If the applicant or his sureties have no such money, they are at liberty to present the documents indicating ownership of an immovable property valued at the equivalent to tshs. 7, 613, 060/= 3) Applicant to report to the office of Nearest Police Station or post nearest to his area of residence within Kondoa District monthly from the date of this order. 4) Applicant to surrender his travelling documents if any to the Magistrate in Charge For Kondoa District Court 5) The applicant shall seek permission from the Registrar of the High Court of Dodoma or Magistrate in Charge For Kondoa District Court if he needs to travel outside Kondo and Dodoma Region. 3 Page 4 HIGH COURT DR. A.J. MAMBI JUDGE 19.08. 2021 Ruling delivered in Chambers this 19th day of August , 2021 in presence of both parties. HIGH CO DR. A.J. MAMBI JUDGE THE 19.08. 2021 4"
  },
  {
    "id": "5ba0b89f-70b9-bd29-e919-0133fa939388",
    "text": "Dar Es Salaam Institute of Technology vs Samson Makomba (Revision 585 of 2018) [2020] TZHCLD 29 (04 March 2020); Page 1 IN THE HIGH COURT OF TANZANIA LABOUR DIVISION AT DAR ES SALAAM REVISION NO. 585 OF 2018 BETWEEN DAR ES SALAAM INSTITUTE OF TECHNOLOGY ............ APPLICANT VERSUS SAMSON MAKOMBA ............ ......... RESPONDENT RULING Date: 04/03/2020 MWIPOPO, J. The Respondent in this case filed Notice of the Preliminary Objection (P.O) containing two points of Law. The first point is that the Application has been filed in the non-existing Labour Court Registry; and the second point of the Preliminary Objection (P.O) is that the application is supported by a defective Affidavit. When the matter came for hearing on 04/03/2020 the learned Counsel for the Applicant Advocate Nelson Ndelwa conceded before parties make submissions on the points of the Preliminary Objection raised. The learned Counsel prayed for the leave of the Court to file a fresh and proper Application. The Personal Representative for the Respondent Mr. Gaudine Mrugaruga did not have any objection to the prayers. Page 2 Following the decision of the learned Counsel for Applicant to concede to the Preliminary Objection, I hereby strike out the Application with the leave to re-file within fourteen (14) days from today. It is so ordered. JUDGE 04/03/2020 N"
  },
  {
    "id": "0313f37d-86af-6760-a0f2-77f16f784130",
    "text": "Monica Hosea Macha vs Itech- Tanzania (Revision 411 of 2018) [2020] TZHCLD 5 (31 March 2020); Page 1 IN THE HIGH COURT OF TANZANIA LABOUR DIVISION AT DAR ES SALAAM REVISION NO. 411 OF 2018 MONICA HOSEA MACHA.......... VERSUS I-TECH TANZANIA.101010 RESPONDENT JUDGMENT Date of last Order: 26/03/2020 Date of Judgment: 31/03/2020 Z.G.Muruke, J. I will place this case in the exceptional category. Applicant has been denied right of revision, reason being loss of Commission for Mediation and Arbitration (CMA) records. In the cause of insisting calling for records, this court on 17th February, 2020 issued following orders:- (i) This is 2012 old&quot;case, since filed at Commission for Mediation and Arbitration (CMA). It is now (8) eight years old. CMA records has not been forwarded despite several court orders. .This is not health situation. This case has been cause listed for clearance session, records need to be forwarded on or before 21st February, 2020. In case, records cannot be traced, an affidavit to be sworn by officer concerned to that effect, for this court to issue necessary orders, for interest of justice. Page 2 (ii) Hearing of revision on 26th February, 2020 at 10 am. (ii) Deputy Registrar to write letter to CMA, attaching today&apos;s proceedings to ensure compliance. On 24th February, 2020, case could not proceed, it was adjoined to 26th March, 2020. Before hearing this court received an affidavit from Commission for Mediation and Arbitration (CMA) Dar es Salaam regarding the missing case file on 6&quot; March, 2020. For clarity paragraph 4,5 and 6 read as follows:- 4. That it is to my knowledge, the case file has been being called by your honourable court through the Hon. Deputy Registrar for purpose of revision and the last call was issued by letter dated 03/03/2020 to which an order issued by Hon. Muruke, J was attached. 5. That the case file which is the subject of this affidavit was determined by Hon. Grace W. Massawe (Arbitrator) but according to her, she submitted the case file to Hon. Marry Kamara who was the Officer In- charge responsible to submit records to your honourable court before she retired. 6. . That in the course of implementing several calls and/or orders of your honourable court to make sure the file is submitted, the Commission, using all its resources has tirelessly searched for the said file but all the efforts did not materialize. I commend Commission for Mediation and Arbitration (CMA) Dar es Salaam administration for informing this court the status of the records. It shows sense of responsibility, and accountability. It is good to take action than not, whatever challenging it might be. 2 Page 3 On 26th March 2020, when the matter came for hearing, court informed and read affidavit regarding missing file to the parties representative. In response Mr. Sammy Katerega, applicants Personal Representative replied as follows: &quot;We have heard the content of affidavit. I think the best way is to order reconstruction of file at CMA using parties records.&quot; Fatma Mugunya counsel for the &quot;respondent replied as follows&apos; &quot;in totally agree with proposal of an order of reconstruction of file and re- trial at CMA. &quot; With the above short submission by parties representative, and affidavit confirming missing CMA records, what is court suppose to do under the circumstances. It is worth noting that the disappearance of files in courts has become a serious and frustrating impediment in dispensation of justice. In a bid to cure this malady, the courts have devised various mechanisms and these include one; the issuance of orders of retrial, two; issuance orders of reconstruction of the lost file, or an automatic acquittal in criminal cases. In generally, where it is apparent that the records will never be traced the matter is left to the court for appropriate orders. I must admit that this is not the first time the court is confronted with such a frustrating situation. In JUMA SAIDI RASHIDI &amp; YUSSUF SAID SHIRONGWA VS. THE REPUBLIC, Criminal Application No. 44 &amp; 45 of 2011, High Court (Sumari, J) Mwanza (Unreported) the court held that:- Subsequently as correctly pointed out by the Republic in this case the applicants have already served half of the sentence Page 4 i.e. 15 years, a substantial part of sentence of 30 years awarded. It would therefore be not in the interest of justice for them to undergo a new trial as the served sentence is enough punishment for them to get a lesson. I therefor quash the conviction on the ground that as the record of the original case is not traceable and it is impossible for it to be obtained. The sentence also is set aside since the party served sentence seems to be just on both sides. Applicant&apos;s conviction is quashed and their main part of sentence unserved is set aside. The applicants are therefore entitled to freedom as from now. Let them be set free forthwith unless otherwise lawfully held. In the Republic Vs. Wambura Chacha, Criminal Revision No. 2 of 2008, High Court Mwanza - Masanche, J (unreported) the court quashed the conviction and set aside part of the un-served sentence on reason that the applicants had served a substantial part of their thirty years imprisonment sentence and it was in the interest of justice which required the applicants not to undergo a fresh trial. Elsewhere, in India, in the case of GOOROO DYAL SINGH VS. DURBAREELAL, 7 WR 18, 1867, the records of the Trial Court were lost in transit from the first court to the second. The High Court held that the court had to choose between directing the Court below to receive such secondary evidence of the contents of the original records as will be forthcoming or to direct an entirely new trial. However, it is settled that in ordering so, the court must always have regard to the questions whether the trial was defective, whether the interest of justice so requires and 4 Page 5 whether the order won&apos;t prejudice the accused. In FATEHALI MANJI VS. THE REPUBLIC [1966] 1 EA 343, the court held at page 344: &quot;... in general a retrial will be ordered only when the original trial was illegal or defective, it will not be ordered where the conviction is set aside because of insufficiency of evidence or for the purpose of enabling the prosecution to fill up gaps in its evidence at the first trial; even where a conviction is vitiated by a mistake of the trial court for which the prosecution is not to blame, it does not necessarily follow that a retrial should be ordered; each case must depend on its particular facts and circumstances and an order for retrial should only be made where the interests of justice require it and should not be ordered where it is likely to cause an injustice to the accused person.&quot; Likewise, it was held in AHMEDI ALI DHARAMSI SUMAR VS REPUBLIC,[1964]1 EA 481 at page 483 that: &quot;Each case must depend on the particular facts and circumstances of that case but an order for re-trial should only be made where the interest of justice require it, and should not be ordered where it is likely to cause an injustice to an accused person.&quot; More considerations of what a court should do in a situation like the one we have now, was stated in WAINAINA VS. REPUBLIC [2004]2 EA 349, the court held at page 350: 5 Page 6 &quot;In such a situation as this, the Court must try to hold the scales of justice and in doing so must consider all the circumstances under which the loss has occurred. Who occasioned the loss of all the files? Is the appellant responsible&quot; Should he benefit from his own mischief and illegality? In the Final analysis, the paramount consideration must be whether the order proposed to be made is the one which serves the best interest of justice. An acquittal should not follow as a matter of course where a file has disappeared. After all a person, like the appellant, has lost the benefits of the presumption of innocence....he having been convicted by a competence court-and on appeal the burden is on him to show that the Court which convicted him did so in error. Thus, the loss of the files and proceedings may deprive him of ability to discharge that burden, but, it by no means follows that he must of necessity be treated as innocent and automatically acquitted. The interest of justice as a whole must be considered.&quot; It is undeniable fact that absence of records has deprived the applicant of his&quot; right to appeal enshrined under article 13(6)(a) of the Constitution of the United Republic of Tanzania which provides: &quot;When the rights and duties of any person are being determined by the court or any other agency, that person shall be entitled to a fair hearing and to the right of appeal or other legal remedy against the decision of the court or of the other agency concerned.&quot; Page 7 In NDYANABO VS. ATTORNEY GENERAL [2001] 2 E.A 485, it was held that In Tanzania a person&apos;s right to unimpeded access to court &quot;can be limited only by a legislation which is not only clear but which is not violative of the provisions of the constitution.&quot; We have no law barring courts from providing litigants with copies of court proceedings during the course of the trial so as to enable them to conduct an effective defence or to file an appeal. What was requested by the applicant before me, was within the powers of the trial tribunal to meet. The applicant needed the proceedings for her be heard on revision. This, in my considered opinion, would have helped further the interest of justice. It is settled law which binds us, that fair trial must be observed and respected from the moment the case is filed at CMA, until the final determination of the Revision or appeal to the Court of Appeal as the case may be. So, a fair trial, first and foremost, encompasses strict adherence to the rules of natural justice, whose breach would lead to the nullification of the proceedings. Court of law have a constitutional obligation to dispense speedy, quality and equal justice. Court, should not &quot;unduly allow any of the parties to tactly introduce delay or be a clog on the wheel of progress of justice, or unduly deny any party his right to prosecute, defend, or file revision and or appeal as the case may be. Commission, Tribunal and all courts of law, must ensure that records are ready available and forwarded once required on appeal or revision for furtherance of interest of justice. 7 Page 8 It sounds unfair and inequitable, in my considered opinion, for a party to criminal/civil litigation to be punished for an error committed by the court and more specifically where the error is within the domestic affairs of the court. Throughout history, courts of law have assumed the position of custodians of justice. It therefore comes as a surprise and indeed it lowers down the reputation and respect of the court when parties submitting themselves to the jurisdiction of the court delay their cases for wrongs committed by court. Courts of law should ensure that it&apos;s records are in place and ready available for furtherance of interest of justice. I have considered, injustice to the parties if any. I see none, much as case will be delayed, but right of being heard is so fundamental to both applicant and respondent. In my opinion, interest of justice in this case demands, quashing of proceedings and setting aside award in labour dispute number CMA/DSM/KIN/219/12. Dispute to start a fresh after sixty days from today, by applicant filing CMA form number one if still interested. Z. G. Muruke JUDGE 31/03/2020 Judgment delivered in the absence of all the parties having notice. Z.G.Muruke JUDGE 31/03/2020"
  }
]